; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v9 ?v2)
             (pred_7 ?v5 ?v4)
             (pred_8 ?v9 ?v4)
             (pred_2 ?v7 ?v9 )
	     (pred_6 ?v9)
             (pred_3 ?v12)
             (pred_12 ?v5)
             (pred_11 ?v4)
             (pred_10 ?v9)
             (pred_9 ?v5)
             (pred_1 ?v9)
             (pred_4 ))



(:action op_2
:parameters (?v1 ?v13 ?v3 ?v6)
:precondition (and (pred_3 ?v1) (pred_3 ?v13) (pred_12 ?v3) (pred_11 ?v6)
          (pred_5 ?v1 ?v13) (pred_7 ?v3 ?v6)
                   (pred_8 ?v13 ?v6) (pred_6 ?v1) 
                   (pred_10 ?v13) (pred_9 ?v3))
:effect (and  (pred_1 ?v13) (not (pred_10 ?v13))))


(:action op_5
:parameters (?v1 ?v11)
:precondition (and (pred_3 ?v1) (pred_3 ?v11)
               (pred_6 ?v1) (pred_5 ?v1 ?v11) (pred_1 ?v11))
:effect (and (pred_6 ?v11) (not (pred_6 ?v1))))

(:action op_1
:parameters (?v1 ?v3)
:precondition (and (pred_3 ?v1) (pred_12 ?v3) 
                  (pred_6 ?v1) (pred_2 ?v3 ?v1) (pred_4 ))
:effect (and (pred_9 ?v3)
   (not (pred_2 ?v3 ?v1)) (not (pred_4 ))))


(:action op_4
:parameters (?v1 ?v8 ?v10)
:precondition (and (pred_3 ?v1) (pred_12 ?v8) (pred_12 ?v10)
                  (pred_6 ?v1) (pred_9 ?v10) (pred_2 ?v8 ?v1))
:effect (and (pred_9 ?v8) (pred_2 ?v10 ?v1)
        (not (pred_9 ?v10)) (not (pred_2 ?v8 ?v1))))

(:action op_3
:parameters (?v1 ?v3)
:precondition (and (pred_3 ?v1) (pred_12 ?v3) 
                  (pred_6 ?v1) (pred_9 ?v3))
:effect (and (pred_4 ) (pred_2 ?v3 ?v1) (not (pred_9 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_04 obj_17 obj_08 obj_18 obj_12 obj_09 obj_01 obj_19 obj_03 obj_15 obj_13 obj_11 obj_02 obj_05 obj_20
    obj_16 obj_14
    obj_06 obj_07
    )

    (:init
       (pred_4)

       (pred_3 obj_10)
       (pred_3 obj_04)
       (pred_3 obj_17)
       (pred_3 obj_08)
       (pred_3 obj_18)
       (pred_3 obj_12)
       (pred_3 obj_09)
       (pred_3 obj_01)
       (pred_3 obj_19)
       (pred_3 obj_03)
       (pred_3 obj_15)
       (pred_3 obj_13)
       (pred_3 obj_11)
       (pred_3 obj_02)
       (pred_3 obj_05)
       (pred_3 obj_20)
       (pred_11 obj_16)
       (pred_11 obj_14)
       (pred_12 obj_06)
       (pred_12 obj_07)

       (pred_5 obj_10 obj_18)
       (pred_5 obj_10 obj_04)
       (pred_5 obj_04 obj_12)
       (pred_5 obj_04 obj_17)
       (pred_5 obj_04 obj_10)
       (pred_5 obj_17 obj_09)
       (pred_5 obj_17 obj_08)
       (pred_5 obj_17 obj_04)
       (pred_5 obj_08 obj_01)
       (pred_5 obj_08 obj_17)
       (pred_5 obj_18 obj_19)
       (pred_5 obj_18 obj_12)
       (pred_5 obj_18 obj_10)
       (pred_5 obj_12 obj_03)
       (pred_5 obj_12 obj_09)
       (pred_5 obj_12 obj_04)
       (pred_5 obj_12 obj_18)
       (pred_5 obj_09 obj_15)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_09 obj_17)
       (pred_5 obj_09 obj_12)
       (pred_5 obj_01 obj_13)
       (pred_5 obj_01 obj_08)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_19 obj_11)
       (pred_5 obj_19 obj_03)
       (pred_5 obj_19 obj_18)
       (pred_5 obj_03 obj_02)
       (pred_5 obj_03 obj_15)
       (pred_5 obj_03 obj_12)
       (pred_5 obj_03 obj_19)
       (pred_5 obj_15 obj_05)
       (pred_5 obj_15 obj_13)
       (pred_5 obj_15 obj_09)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_13 obj_20)
       (pred_5 obj_13 obj_01)
       (pred_5 obj_13 obj_15)
       (pred_5 obj_11 obj_02)
       (pred_5 obj_11 obj_19)
       (pred_5 obj_02 obj_05)
       (pred_5 obj_02 obj_03)
       (pred_5 obj_02 obj_11)
       (pred_5 obj_05 obj_20)
       (pred_5 obj_05 obj_15)
       (pred_5 obj_05 obj_02)
       (pred_5 obj_20 obj_13)
       (pred_5 obj_20 obj_05)
       (pred_10 obj_10)
       (pred_10 obj_04)
       (pred_8  obj_10 obj_16)
       (pred_8  obj_04 obj_14)
       (pred_1 obj_17)
       (pred_1 obj_08)
       (pred_1 obj_18)
       (pred_1 obj_12)
       (pred_1 obj_09)
       (pred_1 obj_01)
       (pred_1 obj_19)
       (pred_1 obj_03)
       (pred_1 obj_15)
       (pred_1 obj_13)
       (pred_1 obj_11)
       (pred_1 obj_02)
       (pred_1 obj_05)
       (pred_1 obj_20)

       (pred_7  obj_06 obj_16)
       (pred_7  obj_07 obj_14)
       (pred_2 obj_06 obj_01)
       (pred_2 obj_07 obj_13)
       (pred_6 obj_05)
    )

    (:goal (and
       (pred_2 obj_07 obj_09)
    ))
(:constraints
  (always (not (pred_6 obj_15)))
)
)

; plan
1. (op_5 obj_05 obj_20)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_20)
   goals met: 0 of 1
2. (op_5 obj_20 obj_13)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_13)
   goals met: 0 of 1
3. (op_1 obj_13 obj_07)
   deleted: (pred_2 obj_07 obj_13) (pred_4)
   added: (pred_9 obj_07)
   goals met: 0 of 1
4. (op_5 obj_13 obj_01)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_01)
   goals met: 0 of 1
5. (op_5 obj_01 obj_09)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_09)
   goals met: 0 of 1
6. (op_3 obj_09 obj_07)
   deleted: (pred_9 obj_07)
   added: (pred_4) (pred_2 obj_07 obj_09)
   goals met: 1 of 1
